# St7GetNodeID

Returns the ID number assigned to the specified node.

long St7GetNodeID(long uID, long NodeNum, long* NodeID)
Input Parameters
uID
Strand7 model file ID.
NodeNum
Node number.
Output Parameters
NodeID
ID number for the specified node.